In [1]:
# Dependencies
import pandas as pd
import scipy.stats as st
import numpy as np

In [2]:
# ratings file
rating = pd.read_csv('../Movies_datasets/ratings.csv')
rating.head()

   userId  movieId  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

In [3]:
rating_df = pd.DataFrame(rating)
rating_df = rating[['movieId','rating']]
rating_df.head()

   movieId  rating
0      110     1.0
1      147     4.5
2      858     5.0
3     1221     5.0
4     1246     5.0

In [4]:
rating_df.rename(columns={'movieId':'id'}, inplace=True,)
rating_df.head()

C:\Users\uldom\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

     id  rating
0   110     1.0
1   147     4.5
2   858     5.0
3  1221     5.0
4  1246     5.0

In [5]:
# Average rating by movie id
rating_df = rating_df.groupby('id')['rating'].mean().reset_index()
rating_df

           id    rating
0           1  3.888157
1           2  3.236953
2           3  3.175550
3           4  2.875713
4           5  3.079565
...       ...       ...
45110  176267  4.000000
45111  176269  3.500000
45112  176271  5.000000
45113  176273  1.000000
45114  176275  3.000000

[45115 rows x 2 columns]

In [6]:
# movies dataset
movies = pd.read_csv('..\Movies_datasets\movies_metadata.csv')
movies = pd.DataFrame(movies)
movies = movies[['id','title','budget','revenue']]
movies.head()

C:\Users\uldom\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

      id                        title    budget      revenue
0    862                    Toy Story  30000000  373554033.0
1   8844                      Jumanji  65000000  262797249.0
2  15602             Grumpier Old Men         0          0.0
3  31357            Waiting to Exhale  16000000   81452156.0
4  11862  Father of the Bride Part II         0   76578911.0

In [7]:
# include a column to calculate the profit for each movie
movies["profit"] = ""
movies

           id                        title    budget      revenue profit
0         862                    Toy Story  30000000  373554033.0
1        8844                      Jumanji  65000000  262797249.0
2       15602             Grumpier Old Men         0          0.0
3       31357            Waiting to Exhale  16000000   81452156.0
4       11862  Father of the Bride Part II         0   76578911.0
...       ...                          ...       ...          ...    ...
45461  439050                       Subdue         0          0.0
45462  111109          Century of Birthing         0          0.0
45463   67758                     Betrayal         0          0.0
45464  227506             Satan Triumphant         0          0.0
45465  461257                     Queerama         0          0.0

[45466 rows x 5 columns]

In [8]:
# cleaning the budget column
clean_movies = movies[movies["budget"] != "/ff9qCepilowshEtG2GYWwzt2bs4.jpg"]
clean_movies = clean_movies[clean_movies["budget"] != "/zV8bHuSL6WXoD6FWogP9j4x80bL.jpg"]
clean_movies = clean_movies[clean_movies["budget"] != "/zaSf5OG7V8X8gqFvly88zDdRm46.jpg"]
clean_movies

           id                        title    budget      revenue profit
0         862                    Toy Story  30000000  373554033.0
1        8844                      Jumanji  65000000  262797249.0
2       15602             Grumpier Old Men         0          0.0
3       31357            Waiting to Exhale  16000000   81452156.0
4       11862  Father of the Bride Part II         0   76578911.0
...       ...                          ...       ...          ...    ...
45461  439050                       Subdue         0          0.0
45462  111109          Century of Birthing         0          0.0
45463   67758                     Betrayal         0          0.0
45464  227506             Satan Triumphant         0          0.0
45465  461257                     Queerama         0          0.0

[45463 rows x 5 columns]

In [9]:
# Budget and revenue as float
clean_movies['budget'] = clean_movies['budget'].astype(float)
clean_movies['revenue'] = clean_movies['revenue'].astype(float)
clean_movies

           id                        title      budget      revenue profit
0         862                    Toy Story  30000000.0  373554033.0
1        8844                      Jumanji  65000000.0  262797249.0
2       15602             Grumpier Old Men         0.0          0.0
3       31357            Waiting to Exhale  16000000.0   81452156.0
4       11862  Father of the Bride Part II         0.0   76578911.0
...       ...                          ...         ...          ...    ...
45461  439050                       Subdue         0.0          0.0
45462  111109          Century of Birthing         0.0          0.0
45463   67758                     Betrayal         0.0          0.0
45464  227506             Satan Triumphant         0.0          0.0
45465  461257                     Queerama         0.0          0.0

[45463 rows x 5 columns]

In [10]:
# obtain the profit as the difference between revenue and budget
clean_movies['profit'] = clean_movies['revenue'] - clean_movies['budget']
clean_movies

,id,title,budget,revenue,profit
0,862,Toy Story,30000000.0,373554033.0,343554033.0
1,8844,Jumanji,65000000.0,262797249.0,197797249.0
2,15602,Grumpier Old Men,0.0,0.0,0.0
3,31357,Waiting to Exhale,16000000.0,81452156.0,65452156.0
4,11862,Father of the Bride Part II,0.0,76578911.0,76578911.0
...,...,...,...,...,...
45461,439050,Subdue,0.0,0.0,0.0
45462,111109,Century of Birthing,0.0,0.0,0.0
45463,67758,Betrayal,0.0,0.0,0.0
45464,227506,Satan Triumphant,0.0,0.0,0.0
45465,461257,Queerama,0.0,0.0,0.0

In [11]:
rating_df

           id    rating
0           1  3.888157
1           2  3.236953
2           3  3.175550
3           4  2.875713
4           5  3.079565
...       ...       ...
45110  176267  4.000000
45111  176269  3.500000
45112  176271  5.000000
45113  176273  1.000000
45114  176275  3.000000

[45115 rows x 2 columns]

In [12]:
# Identify the type
clean_movies.dtypes,rating_df.dtypes

(id          object
 title       object
 budget     float64
 revenue    float64
 profit     float64
 dtype: object,
 id          int64
 rating    float64
 dtype: object)

In [13]:
# converting to the same type of variable
clean_movies['id'] = clean_movies['id'].astype('int64')

In [14]:
#same types
clean_movies.dtypes,rating_df.dtypes

(id           int64
 title       object
 budget     float64
 revenue    float64
 profit     float64
 dtype: object,
 id          int64
 rating    float64
 dtype: object)

In [18]:
# merge both cleanig dataframes

movie_rating = clean_movies.merge(rating_df, on='id', how='left')
movie_rating

,id,title,budget,revenue,profit,rating
0,862,Toy Story,30000000.0,373554033.0,343554033.0,3.598930
1,8844,Jumanji,65000000.0,262797249.0,197797249.0,3.760163
2,15602,Grumpier Old Men,0.0,0.0,0.0,NaN
3,31357,Waiting to Exhale,16000000.0,81452156.0,65452156.0,NaN
4,11862,Father of the Bride Part II,0.0,76578911.0,76578911.0,NaN
...,...,...,...,...,...,...
45458,439050,Subdue,0.0,0.0,0.0,NaN
45459,111109,Century of Birthing,0.0,0.0,0.0,2.583333
45460,67758,Betrayal,0.0,0.0,0.0,NaN
45461,227506,Satan Triumphant,0.0,0.0,0.0,NaN
45462,461257,Queerama,0.0,0.0,0.0,NaN

In [19]:
# create the csv file
movie_rating.to_csv(r'D:\036_Rice\1_Homework_UD\project_2\movie_rating_UD.csv', index = False)

In [16]:
# drop NaN
# movie_rating = movie_rating[movie_rating['rating'].notna()]
# # movie_rating.dropna(inplace=True)
# movie_rating

,id,title,budget,revenue,profit,rating
0,862,Toy Story,30000000.0,373554033.0,343554033.0,3.598930
1,8844,Jumanji,65000000.0,262797249.0,197797249.0,3.760163
5,949,Heat,60000000.0,187436818.0,127436818.0,3.905544
9,710,GoldenEye,58000000.0,352194034.0,294194034.0,2.740334
14,1408,Cutthroat Island,98000000.0,10017322.0,-87982678.0,3.710181
...,...,...,...,...,...,...
45403,98604,Cinderella,0.0,0.0,0.0,3.795053
45430,5589,Å Ã­lenÄ› smutnÃ¡ princezna,0.0,0.0,0.0,3.126140
45433,45527,The Final Storm,0.0,0.0,0.0,2.791667
45447,49280,The One-Man Band,0.0,0.0,0.0,3.390625
45459,111109,Century of Birthing,0.0,0.0,0.0,2.583333